<html> <img style="float:center; margin: 0px 0px 0px 0px;" src="https://docs.google.com/uc? export=download&id=1JDfKEyqZsOrv8tZrgeIDJFQ_c_W0LF-K" width="370" align="left"/> </html> 


<center> <H1> <b>Data Analysis with Python </b><figure> </H1> </center>
<center> <H6>  </H6> </center>

# Pivoting in Pandas

In [ ]:
import pandas as pd
import numpy as np

## Pivoting “Long” to “Wide” Format

In [ ]:
stock=pd.DataFrame(
    {"fruit": ["apple", "plum","grape"]*2,
     "color": ["purple","yellow"]*3,
     "piece":[3,4,5,6,1,2]})

In [ ]:
stock

   fruit   color  piece
0  apple  purple      3
1   plum  yellow      4
2  grape  purple      5
3  apple  yellow      6
4   plum  purple      1
5  grape  yellow      2

In [ ]:
stock.pivot("fruit", "color", "piece")

color  purple  yellow
fruit
apple       3       6
grape       5       2
plum        1       4

In [ ]:
stock["value"]=np.random.randn(len(stock))

In [ ]:
stock

   fruit   color  piece     value
0  apple  purple      3 -0.038716
1   plum  yellow      4 -0.069972
2  grape  purple      5 -1.116665
3  apple  yellow      6  0.374715
4   plum  purple      1 -0.023233
5  grape  yellow      2  0.608953

In [ ]:
p=stock.pivot("fruit","color")
p

       piece            value
color purple yellow    purple    yellow
fruit
apple      3      6 -0.038716  0.374715
grape      5      2 -1.116665  0.608953
plum       1      4 -0.023233 -0.069972

In [ ]:
p["value"]

color    purple    yellow
fruit
apple -0.038716  0.374715
grape -1.116665  0.608953
plum  -0.023233 -0.069972

## Pivoting “Wide” to “Long” Format

In [ ]:
data=pd.DataFrame(
    {"lesson":["math","stat","bio"],
     "Sam":[50,60,70],
     "Kim":[80,70,90],
     "Tom":[60,70,85]})
data

  lesson  Sam  Kim  Tom
0   math   50   80   60
1   stat   60   70   70
2    bio   70   90   85

In [ ]:
group=pd.melt(data,["lesson"])

In [ ]:
group

  lesson variable  value
0   math      Sam     50
1   stat      Sam     60
2    bio      Sam     70
3   math      Kim     80
4   stat      Kim     70
5    bio      Kim     90
6   math      Tom     60
7   stat      Tom     70
8    bio      Tom     85

In [ ]:
data=group.pivot(
    "lesson","variable","value")
data

variable  Kim  Sam  Tom
lesson
bio        90   70   85
math       80   50   60
stat       70   60   70

In [ ]:
data.reset_index()

variable lesson  Kim  Sam  Tom
0           bio   90   70   85
1          math   80   50   60
2          stat   70   60   70